Documents/Выселение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Выселение</Name>
			<BasedOn>
				<xr:Item>Document.Заселение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиБронирования</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВыселенийПоЗаселениям</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВыселения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заселение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заселение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГостиПоМестам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиВыселенийПоЗаселениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиВыселенийПоЗаселениям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заселение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заселение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиБронирования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.События</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыВыселения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыВыселения</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Выселение/Ext/ObjectModule.bsl
///Copyright (c) 2021, https://github.com/Larii75.
///
///Разрешается повторное распространение и использование как в виде исходного кода, так и в двоичной форме, с изменениями или без, при соблюдении следующих условий:
///
///При повторном распространении исходного кода должно оставаться указанное выше уведомление об авторском праве, этот список условий и последующий отказ от гарантий.
///При повторном распространении двоичного кода должна сохраняться указанная выше информация об авторском праве, этот список условий и последующий отказ от гарантий 
///в документации и/или в других материалах, поставляемых при распространении. 
///Ни название <Организации>, ни имена её сотрудников не могут быть использованы в качестве поддержки или продвижения продуктов, основанных на этом ПО без предварительного письменного разрешения.
///ЭТА ПРОГРАММА ПРЕДОСТАВЛЕНА ВЛАДЕЛЬЦАМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ СТОРОНАМИ «КАК ОНА ЕСТЬ» БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, 
///ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. 
///НИ В КОЕМ СЛУЧАЕ НИ ОДИН ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО СКАЗАНО ВЫШЕ, НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ,
///ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ ПОСЛЕДОВАВШИЕ УБЫТКИ, ВСЛЕДСТВИЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ 
///(ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ, ПРИНЕСЕННЫМИ ИЗ-ЗА ВАС ИЛИ ТРЕТЬИХ ЛИЦ, 
///ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ ВЛАДЕЛЕЦ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.
///
///Copyright (c) 2021, https://github.com/Larii75 All rights reserved.
///
///Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
///
///Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
///Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
///Neither the name of the <ORGANIZATION> nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
///THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, 
///THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER 
///OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, 
///PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
///LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
///EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

#Если Сервер ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заселение") Тогда
		Бронирование = ДанныеЗаполнения.Бронирование;
		Заселение = ДанныеЗаполнения.Ссылка;
		СредствоРазмещения = ДанныеЗаполнения.СредствоРазмещения;
		ЭтажСредстваРазмещения = ДанныеЗаполнения.ЭтажСредстваРазмещения;
		Для Каждого ТекСтрокаГостиПоМестам Из ДанныеЗаполнения.ГостиПоМестам Цикл
			НоваяСтрока = ГостиПоМестам.Добавить();
			НоваяСтрока.Гость = ТекСтрокаГостиПоМестам.Гость;
			НоваяСтрока.Комната = ТекСтрокаГостиПоМестам.Комната;
			НоваяСтрока.Место = ТекСтрокаГостиПоМестам.Место;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиВыселенийПоЗаселениям.Записывать = Истина;
	Движения.ОстаткиВыселенийПоЗаселениям.Очистить();
 	Движения.ОстаткиВыселенийПоЗаселениям.Записать();
	
	Движения.ОстаткиБронирования.Записывать = Истина;
	Движения.ОстаткиБронирования.Очистить();
 	Движения.ОстаткиБронирования.Записать();
	
	Движения.ОборотыВыселения.Записывать = Истина;
	Движения.ОборотыВыселения.Очистить();
 	Движения.ОборотыВыселения.Записать();
		
	Движения.ОстаткиВыселенийПоЗаселениям.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиБронирования.БлокироватьДляИзменения = Истина;
	Движения.ОборотыВыселения.БлокироватьДляИзменения = Истина;
	
	Движения.ОстаткиВыселенийПоЗаселениям.Записывать = Истина;
	Движения.ОстаткиБронирования.Записывать = Истина;
	Движения.ОборотыВыселения.Записывать = Истина;
	
	Для Каждого ТекСтрокаГостиПоМестам Из ГостиПоМестам Цикл
		
		// регистр ОстаткиВыселенийПоЗаселениям Расход
		Движение2 = Движения.ОстаткиВыселенийПоЗаселениям.Добавить();
		Движение2.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение2.Период = Дата;
		Движение2.Бронирование = Бронирование;
		Движение2.Заселение = Заселение;
		Движение2.СредствоРазмещения = СредствоРазмещения;
		Движение2.ЭтажСредстваРазмещения = ЭтажСредстваРазмещения;
		Движение2.КомнатаСредстваРазмещения = ТекСтрокаГостиПоМестам.Комната;
		Движение2.МестоРазмещения = ТекСтрокаГостиПоМестам.Место;
		Движение2.Гость = ТекСтрокаГостиПоМестам.Гость;
		Движение2.Количество = 1;
		
		// регистр ОстаткиБронирования Приход
		Движение3 = Движения.ОстаткиБронирования.Добавить();
		Движение3.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение3.Период = Дата;
		Движение3.МояОрганизация = Бронирование.МояОрганизация;
		Движение3.Событие = Бронирование.Событие;
		Движение3.Бронирующий = Бронирование.Бронирующий;
		Движение3.Бронирование = Бронирование;
		Движение3.СредствоРазмещения = СредствоРазмещения;
		Движение3.ЭтажСредстваРазмещения = ЭтажСредстваРазмещения;
		Движение3.КомнатаСредстваРазмещения = ТекСтрокаГостиПоМестам.Комната;
		Движение3.МестоРазмещения = ТекСтрокаГостиПоМестам.Место;
		Движение3.Количество = 1;

		// регистр ОборотыВыселения
		Движение4 = Движения.ОборотыВыселения.Добавить();
		Движение4.Период = Дата;
		Движение4.Бронирование = Бронирование;
		Движение4.СредствоРазмещения = СредствоРазмещения;
		Движение4.ЭтажСредстваРазмещения = ЭтажСредстваРазмещения;
		Движение4.КомнатаСредстваРазмещения = ТекСтрокаГостиПоМестам.Комната;
		Движение4.МестоРазмещения = ТекСтрокаГостиПоМестам.Место;
		Движение4.Гость = ТекСтрокаГостиПоМестам.Гость;
		Движение4.Количество = 1;
				
	КонецЦикла;
	
КонецПроцедуры
	
#Иначе

ВызватьИсключение("Недопустимый вызов объекта на клиенте!");

#КонецЕсли
